# Тип данных это отрезок допустимых значений. Тип данных у переменной
# зависит от значения, которое хранится в переменной

# int - это тип данных для хранения целых чисел
# x = 10
# print(type(x))

# float - это тип данных для хранения вещественных чисел
# a = 3.75
# print(type(a))

# str - Строковый тип данных обозначается через одинарные или двойные кавычки
# s = "welcome"
# print(type(s))

# Логический данных bool допускает два значения - True(правда) и False (ложь)
# Операции сравнения: >, >=,<,<=,==(проверка на равенство),!= (не равно)

# is_right = 2 != 1
# print(type(is_right))
# print(is_right)