# Множество - это набор уникальных элементов
#
# s1 = set()
# s2 = {2,3,5,2,3}
# print(s2)

# list1 = [2,3,5,2,3]
# Чтобы избавиться от дубликатов в списке используйте преобразование к множеству
# print(list(set(list1)))

# data = set()
#
# while 1:
#     x = input('Введите любой текст или - 1 для выхода')
#     if x == '-1':
#         break
#     data.add(x)
# print(data)
#
# Порядок вставки элемента не сохраняется

# Дополнительные операции с множествами:

# a = {1,2,3}
# b = {4,2,5}
# # x = a.union(b) #объединение множест
# # v = a.intersection(b) #получаем общие данные
# # print(v)
# # print(x)
# d = a.difference(b) #из множества а убираем всё, что есть в b
# print(d)

# Получение элемента из кортежа

# k = (1,2,3,4,5)
# print(k[1])

